package com.unipi.Stavrosvl7;

interface Option {
    String Title(); /*η συναρτηση ειναι string για να επιστρέφει σε μορφή string τα options των menu*/
    boolean Action(); /* η συναρτηση ειναι boolean για να μπορω να αλλαζω απο το menu στο submenu,
                       επιστρεφοντας true κανει return στο προηγουμενο menu η κλεινει το προγραμμα αν κληθεί η exit στο κυρίως μενού,
                       και τελος επιστρεφοντας false παραμένω στο ίδιο menu όπου βρισκεται το προγραμμα εκείνη τη στιγμή.
                       Επίσης όλες οι action ολων των options του menu επιστρεφουν false για να μπορούμε να συνεχίζουμε την πλοήγηση μας στον καταλογο
                       και προφανώς ολες οι action ολων των options του submenu επιστρεφουν true για να γυρισουμε ξανα στο κυριο menu και να συνεχισουμε
                       την πλοηγηση μας στον καταλογο.(Η exit επιστρεφει παντα true) */
}
